# Задача 2

num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))
print(num1 if num1 > num2 else num2)


# Задача 3

num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))
if abs(num1 - num2) == 135:
    print('yes')
else:
    print('no')


# Задача 4

spring = [3, 4, 5]
summer = [6, 7, 8]
autumn = [9, 10, 11]
winter = [12, 1, 2]
num1 = int(input('Введите число: '))
if num1 == 3:
    print('spring')
if num1 == 4:
    print('spring')
if num1 == 5:
    print('spring')
if num1 == 6:
    print('summer')
if num1 == 7:
    print('summer')
if num1 == 8:
    print('summer')
if num1 == 9:
    print('autumn')
if num1 == 10:
    print('autumn')
if num1 == 11:
    print('autumn')
if num1 == 12:
    print('winter')
if num1 == 1:
    print('winter')
if num1 == 2:
    print('winter')


# Задача 5

num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))
num3 = int(input('Введите третье число: '))
if num1 > 10 and num2 > 10 and num3 > 10:
    print('yes')
else:
    print('no')

